app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["created_at", Tue, 30 Oct 2012 05:22:26 UTC +00:00], ["tags", ""], ["title", ""], ["updated_at", Tue, 30 Oct 2012 05:22:26 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "content" = 'Here we go again. After giving up...then trying again...then giving up again...and then trying to ship my app with anything but Heroku...I''m back. This time I will succeed or die trying. I will chronicle my steps here for my own purposes. Who knows, maybe it will turn out to be a helpful post. Wish me luck.
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])